src/main/resources/wsdl/crm/customer/service/GetContextWithOperations/1.0/GetContextWithOperations.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions
    targetNamespace="http://www.everythingeverywhere.com/crm/customer/service/GetContextWithOperations/v1.0"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:fault="http://www.everythingeverywhere.com/common/message/FaultMessage/v1.0"
    xmlns:req="http://www.everythingeverywhere.com/crm/customer/service/GetContextWithOperations/GetContextWithOperationsRequest/v1.0"
    xmlns:res="http://www.everythingeverywhere.com/crm/customer/service/GetContextWithOperations/GetContextWithOperationsResponse/v1.0"
    xmlns:soapHeader="http://www.everythingeverywhere.com/common/message/SoapHeader/v1.0"
    xmlns:tns="http://www.everythingeverywhere.com/crm/customer/service/GetContextWithOperations/v1.0" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/">
    <documentation>GetContextWithOperations WSDL V1.0</documentation>
    <!--========================================================-->
    <!--             I M P O R T E D  F I L E S 				-->
    <!--========================================================-->
    <import
        location="../../../../../common/message/1.0/FaultMessage.wsdl" namespace="http://www.everythingeverywhere.com/common/message/FaultMessage/v1.0"/>
    <!--========================================================-->
    <!--                      T Y P E S              			-->
    <!--========================================================-->
    <types>
        <schema elementFormDefault="unqualified"
            targetNamespace="http://www.everythingeverywhere.com/crm/customer/service/GetContextWithOperations/v1.0" xmlns="http://www.w3.org/2001/XMLSchema">
            <!-- XSD import for SoapHeader -->
            <import
                namespace="http://www.everythingeverywhere.com/common/message/SoapHeader/v1.0" schemaLocation="../../../../../common/message/1.0/SoapHeader.xsd"/>
            <!-- XSD import for Request/Response -->
            <import
                namespace="http://www.everythingeverywhere.com/crm/customer/service/GetContextWithOperations/GetContextWithOperationsRequest/v1.0" schemaLocation="GetContextWithOperationsRequest.xsd"/>
            <import
                namespace="http://www.everythingeverywhere.com/crm/customer/service/GetContextWithOperations/GetContextWithOperationsResponse/v1.0" schemaLocation="GetContextWithOperationsResponse.xsd"/>
        </schema>
    </types>
    <!--========================================================-->
    <!--                    M E S S A G E S           			-->
    <!--========================================================-->
    <message name="trackingHeader">
        <part element="soapHeader:trackingHeader" name="trackingHeader"/>
    </message>
    <message name="getContextWithOperationsRequest">
        <part element="req:getContextWithOperations" name="parameters"/>
    </message>
    <message name="getContextWithOperationsResponse">
        <part element="res:getContextWithOperationsResponse" name="parameters"/>
    </message>
    <!--========================================================-->
    <!--                    P O R T  T Y P E         			-->
    <!--========================================================-->
    <portType name="GetContextWithOperations">
        <operation name="getContextWithOperations">
            <input message="tns:getContextWithOperationsRequest" name="getContextWithOperationsRequest"/>
            <output message="tns:getContextWithOperationsResponse" name="getContextWithOperationsResponse"/>
            <fault message="fault:technicalFault" name="technicalFault">
               
            </fault>
            <fault message="fault:businessFault" name="businessFault">
               
            </fault>
        </operation>
    </portType>
    <!--========================================================-->
    <!--                     B I N D I N G           			-->
    <!--========================================================-->
    <binding name="GetContextWithOperationsSoapBinding" type="tns:GetContextWithOperations">
        <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="getContextWithOperations">
            <input>
                <wsdlsoap:header message="tns:trackingHeader"
                    part="trackingHeader" use="literal"/>
                <wsdlsoap:body parts="parameters" use="literal"/>
            </input>
            <output>
                <wsdlsoap:body parts="parameters" use="literal"/>
            </output>
            <fault name="technicalFault">
                <wsdlsoap:fault name="technicalFault" use="literal"/>
            </fault>
            <fault name="businessFault">
                <wsdlsoap:fault name="businessFault" use="literal"/>
            </fault>
        </operation>
    </binding>
    <!--========================================================-->
    <!--              S E R V I C E  			    			-->
    <!--========================================================-->
    <service name="getContextWithOperationsService">
        <port binding="tns:GetContextWithOperationsSoapBinding" name="GetContextWithOperations_1.0">
            <wsdlsoap:address location="http://localhost/service/getContextWithOperations-1_0"/>
        </port>
    </service>
</definitions>
